<template>
  <header class="download-header">
    <h1>Файл успешно обработан!</h1>
    <span @click="$router.push('/')">
      <svg width="8" height="12" viewBox="0 0 8 12" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M3.29 6.00001L6.83 2.46001C7.01626 2.27265 7.1208 2.0192 7.1208 1.75501C7.1208 1.49082 7.01626 1.23737 6.83 1.05001C6.73704 0.956281 6.62644 0.881887 6.50458 0.831118C6.38272 0.780349 6.25202 0.754211 6.12 0.754211C5.98799 0.754211 5.85729 0.780349 5.73543 0.831118C5.61357 0.881887 5.50297 0.956281 5.41 1.05001L1.17 5.29001C1.07628 5.38297 1.00188 5.49357 0.951114 5.61543C0.900345 5.73729 0.874207 5.868 0.874207 6.00001C0.874207 6.13202 0.900345 6.26273 0.951114 6.38459C1.00188 6.50645 1.07628 6.61705 1.17 6.71001L5.41 11C5.50344 11.0927 5.61426 11.166 5.7361 11.2158C5.85794 11.2655 5.9884 11.2908 6.12 11.29C6.25161 11.2908 6.38207 11.2655 6.50391 11.2158C6.62575 11.166 6.73656 11.0927 6.83 11C7.01626 10.8126 7.1208 10.5592 7.1208 10.295C7.1208 10.0308 7.01626 9.77737 6.83 9.59001L3.29 6.00001Z" fill="black"/>
      </svg>
      <p>Назад</p>
    </span>
  </header>
  <main>
    <div class="download-wrapper__files">
      <div class="app__text">
        <p>Вы можете открыть папку с файлом</p>
      </div>
      <div class="files-item" @click="openFilePath">
        <div class="files-item__type">
            <p>{{ getConvertFileData.convertTo }}</p>
        </div>
        <div class="files-item__info">
          <p>{{ getConvertFileData.inputData.filename }}.{{ getConvertFileData.convertTo }}</p>
<!--          <small>Размер: - Кб.</small>-->
        </div>
        <div class="files-item__del">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17 3.50002H10.72L10.4 2.50002C10.1926 1.91325 9.80775 1.40553 9.2989 1.04718C8.79005 0.688841 8.18236 0.497623 7.56 0.500022H3C2.20435 0.500022 1.44129 0.816093 0.87868 1.3787C0.316071 1.94131 0 2.70437 0 3.50002V16.5C0 17.2957 0.316071 18.0587 0.87868 18.6213C1.44129 19.184 2.20435 19.5 3 19.5H17C17.7956 19.5 18.5587 19.184 19.1213 18.6213C19.6839 18.0587 20 17.2957 20 16.5V6.50002C20 5.70437 19.6839 4.94131 19.1213 4.3787C18.5587 3.81609 17.7956 3.50002 17 3.50002ZM18 16.5C18 16.7652 17.8946 17.0196 17.7071 17.2071C17.5196 17.3947 17.2652 17.5 17 17.5H3C2.73478 17.5 2.48043 17.3947 2.29289 17.2071C2.10536 17.0196 2 16.7652 2 16.5V3.50002C2 3.23481 2.10536 2.98045 2.29289 2.79292C2.48043 2.60538 2.73478 2.50002 3 2.50002H7.56C7.76964 2.49948 7.97416 2.56484 8.14463 2.68686C8.3151 2.80889 8.44291 2.9814 8.51 3.18002L9.05 4.82002C9.11709 5.01864 9.2449 5.19116 9.41537 5.31318C9.58584 5.4352 9.79036 5.50056 10 5.50002H17C17.2652 5.50002 17.5196 5.60538 17.7071 5.79292C17.8946 5.98045 18 6.23481 18 6.50002V16.5Z" fill="black"/>
          </svg>
        </div>
      </div>
    </div>
  </main>
</template>

<script>
import './download.scss';

import { ipcRenderer } from "electron";
import { mapGetters } from 'vuex'

export default {
  name: "Downloads",
  methods: {
    openFilePath() {
      ipcRenderer.send('openFilePathDialog', this.getConvertFileData.outputData)
    }
  },
  computed: {
    ...mapGetters(['getConvertFileData'])
  },
}
</script>
